STMicroelectronics/STM32CubeH7/Projects/STM32H747I-EVAL/Demonstrations/TouchGFX/Gui/target/BoardConfiguration.cpp
    return 0;
}

namespace touchgfx
{
void hw_init()
{
    if(!DEVICE_IS_CUT_2_X())
    {
        if(!DEVICE_IS_CUT_1_2())
        {
            *((uint32_t*)0x51046108) = 1; /* DMA2D issue with cut 1.1 - fixed in cut 1.2 */
        }
        *((uint32_t*)0x51008108) = 1; /* AXI SRAM issue with cut1.2 - fixed in cut 2.0 */
    }

    /* Enable RTC back-up registers access */
    HAL_PWR_EnableBkUpAccess();

    MPU_Config();
    HAL_Init();

    SystemClock_Config();

    __HAL_RCC_CRC_CLK_ENABLE();

#ifdef USE_STM32H747I_EVAL
    /* Configure IO expanders */
    BSP_IO_Init();
#endif // USE_STM32H747I_EVAL

    /* Initialize the QSPI */
    BSP_QSPI_Init();
    BSP_QSPI_EnableMemoryMappedMode();
    HAL_NVIC_DisableIRQ(QUADSPI_IRQn);

    /* Initialize external SDRAM */
    BSP_SDRAM_Init();

    /* Disable FMC Bank1 to avoid speculative/cache accesses */
    FMC_Bank1_R->BTCR[0] &= ~FMC_BCRx_MBKEN;

#ifdef USE_STM32H747I_DISCO
    /* Init TEMP Sensor */
    TEMP_SENSOR_Init();
#else
    BSP_POTENTIOMETER_Init();
#endif

    /* Initialized RTC */
    RTC_CalendarBkupInit();

    GPIO::init();

    /* Enable CPU L1 Cache */
    CPU_CACHE_Enable();

    /* Initialize display */
    LCD_Init();
}

STM32H7DMA dma;
STM32H747TouchController tc;
STM32H7Instrumentation mcuInstr;

#if !defined(USE_BPP) || USE_BPP==16
static LCD16bpp display;
static uint16_t bitDepth = 16;
#elif USE_BPP==24
static LCD24bpp display;
static uint16_t bitDepth = 24;
#else
#error Unknown USE_BPP
#endif

void touchgfx_init()
{
    uint16_t dispWidth  = 800;
    uint16_t dispHeight = 480;
    uint32_t offset     = (dispWidth * dispHeight * (bitDepth/8)) * 2; /* start address after the snapshot buffer */
    uint8_t *bmpCache   =  reinterpret_cast<uint8_t*>(frameBuf0) + offset;

    HAL& hal = touchgfx_generic_init<STM32H7HAL_DSI>(dma, display, tc, dispWidth, dispHeight,
                                                     (uint16_t*)bmpCache, 4 * 1024 * 1024, 128);

    hal.setFrameBufferStartAddress((uint16_t*)frameBuf0, bitDepth, false, true);

    hal.setTouchSampleRate(1);
    hal.setFingerSize(5);

    // By default frame rate compensation is off.
    // Enable frame rate compensation to smooth out animations in case there is periodic slow frame rates.
    hal.setFrameRateCompensation(false);

    // This platform can handle simultaneous DMA and TFT accesses to SDRAM, so disable lock to increase performance.
    hal.lockDMAToFrontPorch(false);

    mcuInstr.init();

    //Set MCU instrumentation and Load calculation
    hal.setMCUInstrumentation(&mcuInstr);
    hal.enableMCULoadCalculation(true);
}
}

/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 400000000 (CM7 CPU Clock)
  *            HCLK(Hz)                       = 200000000 (CM4 CPU, AXI and AHBs Clock)
  *            AHB Prescaler                  = 2
  *            D1 APB3 Prescaler              = 2 (APB3 Clock  100MHz)
  *            D2 APB1 Prescaler              = 2 (APB1 Clock  100MHz)
  *            D2 APB2 Prescaler              = 2 (APB2 Clock  100MHz)
  *            D3 APB4 Prescaler              = 2 (APB4 Clock  100MHz)
  *            HSE Frequency(Hz)              = 25000000
  *            PLL_M                          = 5
  *            PLL_N                          = 160
  *            PLL_P                          = 2
  *            PLL_Q                          = 4
  *            PLL_R                          = 2
  *            VDD(V)                         = 3.3
  *            Flash Latency(WS)              = 4
  * @param  None
  * @retval None
  */
static void SystemClock_Config(void)
{
#if defined(USE_PWR_LDO_SUPPLY)
    uint32_t power_config = PWR_CFG_LDO;
#else
    uint32_t power_config = PWR_CFG_SMPS;
#endif /* USE_PWR_LDO_SUPPLY */
    RCC_ClkInitTypeDef RCC_ClkInitStruct;
    RCC_OscInitTypeDef RCC_OscInitStruct;
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
    HAL_StatusTypeDef ret = HAL_OK;

  /*!< Supply configuration update enable */
#if defined(USE_STM32H747I_EVAL_OOB)
    HAL_PWR_EnableBkUpAccess();
    power_config = READ_REG(BKP_REG_PWR_CFG);
    HAL_PWR_DisableBkUpAccess();
#endif /* USE_STM32H747I_EVAL_OOB */

    if(power_config == PWR_CFG_LDO)
    {
        HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);
    }
    else
    {
      if(DEVICE_IS_CUT_2_1() == 0)
      {
          /* WA to avoid loosing SMPS regulation in run mode */
          PWDDBG->PDR1 = 0xCAFECAFE;
          __DSB();
          PWDDBG->PDR1 |= (1<<5 | 1<<3);
          __DSB();
      }
      HAL_PWREx_ConfigSupply(PWR_DIRECT_SMPS_SUPPLY);
    }

    /* The voltage scaling allows optimizing the power consumption when the device is 
       clocked below the maximum system frequency, to update the voltage scaling value 
       regarding system frequency refer to product datasheet.  */
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}

    /* Enable HSE Oscillator and activate PLL with HSE as source */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.HSIState = RCC_HSI_OFF;
    RCC_OscInitStruct.CSIState = RCC_CSI_OFF;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;

    RCC_OscInitStruct.PLL.PLLM = 5;
    RCC_OscInitStruct.PLL.PLLN = 160;
    RCC_OscInitStruct.PLL.PLLP = 2;
    RCC_OscInitStruct.PLL.PLLR = 2;
    RCC_OscInitStruct.PLL.PLLQ = 4;

    RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
    RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_2;
    ret = HAL_RCC_OscConfig(&RCC_OscInitStruct);
    if(ret != HAL_OK)
    {
        while (1) { ; }
    }

    /* PLL3 for USB Clock */
    PeriphClkInitStruct.PLL3.PLL3M = 25;
    PeriphClkInitStruct.PLL3.PLL3N = 336;
    PeriphClkInitStruct.PLL3.PLL3P = 2;
    PeriphClkInitStruct.PLL3.PLL3R = 2;
    PeriphClkInitStruct.PLL3.PLL3Q = 7;

